docs: Refactor README for clarity and conciseness
removed unnecessary parts of template.
